events/Data Storage Events/Metadata.identity/ALERT.Stardom.IdentityRemove.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/stardom</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/"    xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>STARDOM</ns1:sender>
                            <ns1:timestamp>10000</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10010</ns1:endTime>
                                <!-- name of event -->
                                <ns1:eventName>ALERT.Stardom.IdentityRemove</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>request</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <sm:identities>
                                    <sm:identity>
                                        <sm:uuid>51d8ecec1d6ea40106c6c71ffed13547010870b0ab57fe396f5fbb124967e0eb</sm:uuid>
                                    </sm:identity>
                                    <sm:identity>
                                        <sm:uuid>e0b2d72cdd7cc4c80a0a57f7462aece5341b228b139d6ccbfa093853b6a16b6b</sm:uuid>
                                    </sm:identity>
                                </sm:identities>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </s:Body>
</s:Envelope>